alexlinde/claudius/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash - 16 MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM - 8 MB Octal
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Place malloc in SPIRAM when possible
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# WiFi
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y

# LVGL (configured via Kconfig, LV_CONF_SKIP=y is the default)
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_LOG=n
CONFIG_LV_USE_BAR=y
CONFIG_LV_USE_IMAGE=y

# lv_tiny_ttf: TrueType rasterizer for runtime-sized fonts.
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_TINY_TTF_FILE_SUPPORT=n

# mDNS
CONFIG_MDNS_MAX_SERVICES=10

# HTTP server (config + OTA)
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Compiler optimisation
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# If LVGL (or anything else) busy-spins and starves IDLE0, reboot instead of
# leaving a frozen screensaver on the panel until someone power-cycles.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
